# Математические Встроенные Функции


# возвращает абслолютное значение числа (без минуса)
abs(-3)  # -> 3

# округляет число в ближайщую сторону
round(4.3)  # -> 4
round(4.7)  # -> 5

# возвращает максиальное число из последовательности
max([1, 5, 7, 3, 2, 1])  # -> 7

# возвращает минимальное число из последовательности
min([1, 5, 7, 3, 2, 1])  # -> 1

# возвращет суму чисел из последовательности
sum([1, 5, 7, 3, 2, 1])  # -> 19

# возводит первое указаное число в вторую указаную степень (2 - в квадрат , 3 - в куб)
pow(5, 2)  # -> 25
