# Цикл While


# while 10 > i:
#     i+=1


# i ето итератор, по которому будем определяеть количество итераций цикла
my_value = 10
i = 0
sum = 0
while my_value > i:
    sum += i  # -> 45
    i += 1


# -----   1) Пример   -------------------------------------------------------------------------------------------------------------------------------------------------------
my_value = 10
i = 0
sum = 0
while i < my_value and i <= 50:
    sum += i  # -> 45
    i += 1


# -----   2) Пример   -------------------------------------------------------------------------------------------------------------------------------------------------------

my_list = [0, 1, 2, 3, 4]
# цикл будет работать пока в списке my_list есть елементы
while my_list:  # -> while True

    element = my_list.pop()

my_list == []  # -> True


# -----   3) Пример   -------------------------------------------------------------------------------------------------------------------------------------------------------

while True:
    answer = input("Enter a number -> ")
    if answer == "exit":
        break
    print(answer)

print("Exit from loop")
