# Индексы и Срезы Списков
# Индексы начинают отсчет с Нуля -> 0


#  0  1  2  3  4      len(my_list) - 1
#  h  e  l  l  o      len(my_list) == 5
#  -5 -4 -3 -2 -1     - len(my_list)

my_list = ["h", "e", "l", "l", "o"]

# берем значение по индексу
my_list[1]  # -> e
my_list[-1]  # -> o

# изменяем значение указаного елемента по индексу
my_list[0] = "t"  # -> ['t', 'e', 'l', 'l', 'o']

# переставляем значение елементов местами
my_list[0], my_list[2] = my_list[2], my_list[0]  # -> ['l', 'e', 't', 'l', 'o']

# срезы [ start : end : step ] возвращает набор елементов списка по указаным индексам
my_list = [1, 2, 3, 4, 5, 6, 7]
my_list[:]  # -> [1, 2, 3, 4, 5, 6, 7]
my_list[1:5]  # -> [2, 3, 4, 5]
my_list[1:5:2]  # -> [2, 4]
my_list[0 : len(my_list)]  # -> [1, 2, 3, 4, 5, 6, 7]
my_list[5:3]  # -> [ ]
my_list[-5:-1]  # -> [3, 4, 5, 6]
my_list[::-1]  # -> [7, 6, 5, 4, 3, 2, 1]


# 1) Разворт Списка
my_list = [1, 2, 3, 4, 5, 6, 7]
new_list = my_list[::-1]  # -> [7, 6, 5, 4, 3, 2, 1]

# 2) Разворот Списка
my_list = [1, 2, 3, 4, 5, 6, 7]
my_list.reverse()  # -> [7, 6, 5, 4, 3, 2, 1]

# 3) Разворот Списка
my_list = [1, 2, 3, 4, 5, 6, 7]
new_list = list(reversed(my_list))  # -> [7, 6, 5, 4, 3, 2, 1]
