# Продвинутая Функция MAP

# Функция MAP применяет нашу указаную функцию my_function к каждому елементу в последовательности my_iterable_object

# map(my_function, *my_iterable_object)  # -> map object


# 1) -----   ПРИМЕР   ----------------------------------------------------------------------------------------------------------------------------------------------------------

my_numbers = [-1, 2, -3, 4, -5, -6, 7]

map(abs, my_numbers)  # -> <map object at 0x00000233EE1B5DB0>

list(map(abs, my_numbers))  # -> [1, 2, 3, 4, 5, 6, 7]


# 2) -----   ПРИМЕР   ----------------------------------------------------------------------------------------------------------------------------------------------------------

# используем генератор списков вместо функции map
# тотже результат только без функции map
my_numbers = [-1, 2, -3, 4, -5, -6, 7]

[abs(x) for x in my_numbers]  # -> [1, 2, 3, 4, 5, 6, 7]


# 3) -----   ПРИМЕР   ----------------------------------------------------------------------------------------------------------------------------------------------------------

my_numbers = [1, 2, 3, 4, 5, 6, 7]


# используем свою функцию
def my_function(number):
    # возводим каждое число в степень
    return number**2


list(map(my_function, my_numbers))  # -> [1, 4, 9, 16, 25, 36, 49]
