# IS указывает ссылаеться ли два обьекта на одну и туже ячейку в памяти (обьекты имеют одинаковые id)


# -----   НЕИЗМЕНЯЕМЫЕ Типы Данных   ----------------------------------------------------------------------------------------------------------------------

a = None
b = None

a is b  # -> True

id(a)  # -> 140722466247248  (одинаковые)
id(b)  # _> 140722466247248  (одинаковые)


my_value = True
my_value == True  # -> True
my_value is True  # -> True  (более правильно)


my_value = None
my_value == None  # -> True
my_value is None  # -> True  (более правильно)


# -----   ИЗМЕНЯЕМЫЕ Типы Данных   ----------------------------------------------------------------------------------------------------------------------

my_list1 = [1, 2, 3]
my_list2 = [1, 2, 3]

my_list1 is my_list2  # -> False

id(my_list1)  # -> 2335716808960  (разные)
id(my_list2)  # -> 2335716807040  (разные)


my_list1 = [1, 2, 3]
my_list2 = my_list1

# оба списка ссылаються на одну ячейку в памяти
my_list1 is my_list2  # -> True

id(my_list1)  # -> 2697156655424  (одинаковые)
id(my_list2)  # -> 2697156655424  (одинаковые)
