# Виды Копирования Словарей

# 1) -----   Простое Копирование   -------------------------------------------------------------------------------------------------------------------------------

my_dict = {"x": 1, "y": 2}
another_dict = my_dict

my_dict  # -> {'x': 1, 'y': 2}
another_dict  # -> {'x': 1, 'y': 2}

id(my_dict)  # -> 2384859359168  (одинаковые)
id(another_dict)  # -> 2384859359168  (одинаковые)

# значение ключа x сразу изменяеться у двух словарей
another_dict["x"] = 777

my_dict  # -> {'x': 777, 'y': 2}
another_dict  # -> {'x': 777, 'y': 2}


# 2) -----   Глубокое Копирование   -------------------------------------------------------------------------------------------------------------------------------

my_dict = {"x": 1, "y": 2}
another_dict = my_dict.copy()

my_dict  # -> {'x': 1, 'y': 2}
another_dict  # -> {'x': 1, 'y': 2}

id(my_dict)  # -> 2082499425984  (не одинаковые)
id(another_dict)  # -> 2036905864000  (не одинаковые)

# значение ключа x изменяеться только в указаном словаре another_dict, а значение в my_dict не изменяеться
another_dict["x"] = 777

my_dict  # -> {'x': 1, 'y': 2}
another_dict  # -> {'x': 777, 'y': 2}


# 3) -----   Глубокое Копирование Вложеных Изменяемых Обьектов (НЕПРАВИЛЬНОЕ КОПИРОВАНИЕ)   -------------------------------------------------------------------------------------------------------------------------------

patient_data = {"heart_rate": [60, 61, 63, 60, 61]}

patient_data_copy = patient_data.copy()

patient_data  # -> {'heart_rate': [60, 61, 63, 60, 61]}  (одинаковые)
patient_data_copy  # -> {'heart_rate': [60, 61, 63, 60, 61]}  (одинаковые)

patient_data_copy["heart_rate"].append(777)

patient_data  # -> {'heart_rate': [60, 61, 63, 60, 61, 777]}  (одинаковые)
patient_data_copy  # -> {'heart_rate': [60, 61, 63, 60, 61, 777]}  (одинаковые)


# 4) -----   Глубокое Копирование Вложеных Изменяемых Обьектов (ПРАВИЛЬНОЕ КОПИРОВАНИЕ)   -------------------------------------------------------------------------------------------------------------------------------

from copy import deepcopy

my_data = {"my_list": [60, 61, 63, 60, 61]}

my_data_copy = deepcopy(my_data)

my_data  # -> {'my_list': [60, 61, 63, 60, 61]}
my_data_copy  # -> {'my_list': [60, 61, 63, 60, 61]}

id(my_data)  # -> 2066792418368  (разные)
id(my_data_copy)  # -> 2448425127232  (разные)

my_data_copy["my_list"].append(777)

my_data  # -> {'my_list': [60, 61, 63, 60, 61]}  (не изменилось)
my_data_copy  # -> {'my_list': [60, 61, 63, 60, 61, 777]}  (изменилось)
